137708
142459
115041
57524
117466
167485
86573
17421
201050
3951
92421
26046
65576
133668
99111
58892
120996
57847
17911
131234
31467
58157
170484
178989
13529
26524
118774
8990
198320
140182
114346
94044
6588
155292
100167
136022
12699
81767
6901
4270
124271
130909
18111
103444
194401
135029
839
193958
169784
122795
21196
90598
27386
28938
21741
62548
196136
131254
109919
171806
127787
139096
31574
149684
174636
56730
163865
176383
88478
6781
133529
63093
17588
108523
153058
114411
44634
11344
53987
132150
133010
179842
138787
5224
34896
42409
112135
168657
178911
14515
163892
98583
14308
187270
27953
35365
154263
124520
57224
118076
68390
93039
51119
14046
198744
199047
152927
10989
79754
139981
131912
117371
1837
172364
28856
88344
74559
200182
158564
144555
3708
20917
154957
93409
187520
104804
52420
104787
17616
136453
94395
75024
38374
124309
195473
26686
121869
48930
48877
110766
149133
22979
158297
62830
82434
137177
18682
28194
13078
39212
117174
19443
1501
181665
97928
11819
119662
189352
4601
180859
80118
102892
6596
34071
19392
173416
36719
92703
124450
127855
198583
83132
138266
140238
16037
27570
18933
87843
10442
111048
193360
71133
187385
49001
88127
157131
191790
102751
146442
113023
152430
117445
180044
12269
21436
93438
37581
201882
89622
57970
52493
62960
48916
5372
16312
173971
71671
84384
25368
16832
125551
31610
64920
133130
70475
199299
126492
11340
170269
6022
177053
92439
167252
14083
92807
171531
136525
203103
23485
28698
183607
172363
160572
102889
73479
135151
157246
121601
119954
139366
22601
144614
19876
143563
92702
104616
28035
175254
91996
145848
48672
31191
70051
159566
202266
124622
194549
156143
112871
23446
72989
181694
89338
19790
181101
138342
102364
202857
42971
41543
65211
36473
124201
145092
67277
93975
132802
54072
94831
132577
55291
115392
194615
35443
16685
435
10947
83565
83049
170879
200490
58760
37764
69084
7009
129023
87857
114667
191702
169807
21083
69103
122797
25232
40091
24460
49139
144154
124068
99192
58650
25026
100696
64426
77161
131913
94803
115309
31651
28846
15066
169034
78566
44592
89360
84369
147665
165664
31487
191879
93940
106309
164058
150249
176193
51464
137499
19475
190517
201417
35139
194415
151695
15760
104585
77250
159305
144110
49082
55050
146778
121352
80865
16344
25620
65989
185974
116920
138184
119725
102165
53207
188497
50175
94400
52086
50366
141114
55289
149990
116069
48500
81334
44542
34213
103639
144402
181110
140539
187816
119368
13365
47806
56538
22063
159270
63299
128512
108756
202385
65495
173880
194304
38916
108515
187723
43862
198724
123729
158811
128231
34819
132729
176045
201311
76203
25810
111296
22470
124099
59583
164617
26373
179061
88045
138927
157608
189534
38915
80775
2818
120754
9201
95416
42017
12600
96878
187207
179819
115471
183044
24255
138774
19779
151901
6179
180699
56667
26822
6284
10683
102665
146760
124628
14692
110429
11740
70583
120531
22604
143852
127845
197118
18915
79401
172355
175579
92779
116878
186849
67706
111819
135443
107678
4279
127927
183169
102020
90411
18780
146874
120174
125250
26427
47127
66489
4883
59539
122290
156951
86746
18937
184841
115238
127335
7
3442
41509
95009
64245
47492
165789
115903
102633
7604
9587
186717
46989
28513
170659
136697
8916
170604
42282
110774
161971
105532
82430
189207
130175
107053
83537
115824
82934
7129
83283
20018
182451
157299
96969
107241
149604
94953
191415
59250
129442
12527
97204
57423
188489
39867
94377
88452
164174
114453
192000
194655
49854
141535
80916
118855
179559
123646
10741
109901
160841
11294
131720
184749
147476
203622
34350
71395
83008
57608
201405
132899
79423
146135
47040
2153
9966
174020
69557
55962
140966
153604
155715
106025
120230
51697
146993
197476
197526
81210
171118
88312
113688
168610
31635
143923
196606
98985
47637
113262
179287
78011
72189
136313
132235
37192
186869
91120
69070
177910
19678
105622
78078
167440
173379
105380
145125
160669
183689
177787
50073
159517
194027
169964
13969
33086
159611
121178
97976
181990
1737
49738
83081
32009
125816
139598
80967
143073
51332
164721
147808
1541
36787
89142
19409
124
131317
153419
130979
9049
186765
172945
136884
140316
182381
49334
113952
156964
193058
195066
125265
166725
166278
34336
122136
112136
160290
27499
94133
170383
6202
91711
58169
5506
154875
170250
194273
105908
200030
119830
127291
38794
135368
179330
140848
159461
190666
138806
145547
109592
28935
79789
28064
80275
68035
185375
20949
144833
202847
17339
106498
92721
70663
159493
157663
51709
58588
106987
170979
106003
70261
199971
73552
105110
112508
60669
36797
127111
203670
162612
145003
72986
115731
155302
47541
47546
130416
136024
166506
201137
196638
143093
196348
78881
60974
147472
69276
170017
18416
203291
118921
9894
113518
182930
195847
89144
69008
76663
37333
83704
106976
15856
170345
112352
129855
174278
130973
59404
153517
124645
54481
8665
99034
52676
167713
163167
62765
188275
99530
161063
85886
129306
165750
190999
162695
46041
23571
124616
81153
180529
75136
165498
73581
99510
133741
178266
160152
106500
88345
31158
156591
12789
149522
134479
133157
49700
123057
81810
117565
7610
44338
65806
95333
184357
110153
180846
163281
15315
73517
203841
138312
102611
83454
124938
25031
148434
130268
82636
1468
66680
50967
47934
86108
90650
141806
109119
135016
67326
192811
111803
27797
200092
103122
94664
138081
62152
26673
155594
116522
7640
28796
1150
186675
132448
134839
68823
117769
161999
18781
116503
44229
105448
54781
172705
60442
102732
185909
143292
120022
77594
177700
47737
193351
72743
86578
18747
42838
98637
129111
202058
98144
3399
127675
160537
189066
125476
75469
357
176723
105845
203663
141224
141210
89672
131574
22176
132192
44316
6697
183364
164199
75911
106918
197782
95722
29246
193280
106688
166948
13364
24911
148155
60084
170448
193600
156548
118618
31848
94855
196548
187442
154094
132407
181206
134256
71107
16330
136132
169945
67597
109213
65036
112169
109799
169138
190048
121959
30627
187088
57428
140963
135447
125671
1915
113058
115077
115675
30662
174141
165296
199329
33569
161722
139416
164170
174139
49104
113063
165983
201972
127805
28464
114782
5384
145898
103310
103423
3293
57266
112151
90642
200298
10810
31938
26888
90505
1108
107153
108013
188176
79419
167684
193189
2468
7421
181633
36210
8532
187620
21512
13544
193986
188
45496
135411
180336
106605
160900
92136
196850
168322
106267
21785
79900
170021
150675
121476
81344
144937
19697
103601
154529
5686
187608
87846
126539
103563
36476
4821
59797
18879
161566
32939
77098
202932
95329
148957
40890
189668
52548
141960
28834
144618
111364
26799
118461
25673
95987
42147
100664
123858
95265
115096
9260
105253
36598
201017
119185
75575
94537
197383
121441
39239
99265
200983
77942
183122
128652
10840
80384
154509
140915
111802
145869
49265
203210
180070
200586
117781
111996
33899
179020
47062
57346
125107
71998
56620
43747
155042
44217
40781
22121
70135
201204
117527
24853
180789
4428
86734
144442
142007
153420
116016
51886
195187
144852
151369
127781
182572
96469
155368
130141
143809
9005
136638
4680
22508
76539
147347
130684
67474
201532
174940
66687
144273
96935
157442
93987
85423
17101
117355
119554
97282
19956
26617
175540
95215
19173
149588
40097
66302
175969
63622
41473
126262
37032
25260
68488
18420
163416
20211
180736
52262
33622
173121
36102
74097
106625
21796
152618
190220
94727
71824
124534
132672
13998
55471
51435
184621
105535
78646
161120
167729
158809
179729
109083
19487
48841
24423
153596
35213
15530
51661
133365
182032
131986
30820
119759
23822
135823
194739
34740
115060
76631
145586
122157
56558
42199
93982
40815
35259
170993
129189
79609
171837
177607
67347
143906
183765
20539
147573
179053
175286
75806
195068
129249
26907
196680
8099
31636
60658
111391
103885
150880
154199
107597
136068
3689
151779
180386
138568
201806
80520
33857
90561
180721
60997
40090
57294
138638
75944
4912
824
188818
77734
54334
13117
4187
94890
102902
133076
50591
13470
5552
89185
148897
191392
170332
103031
34931
140451
68635
52451
36351
9971
97195
17709
202852
29628
181283
92530
160938
83342
53251
761
118607
137559
1912
106202
80733
101123
58074
127145
196631
12098
51163
34632
171314
70726
199723
191827
53652
5110
100842
1371
58967
13469
38793
66655
87872
6514
85378
11911
161591
161055
52364
137672
14750
38095
176423
69903
155455
39891
103633
110698
187557
16156
58895
152476
170700
35181
156910
188135
94846
132588
29205
50313
202219
9101
183275
62331
63356
120499
2826
19245
105245
170671
21205
70351
122510
131441
74592
110792
57559
15358
104915
136124
172198
4143
48264
6135
46205
87343
150597
25747
47415
188624
139500
187893
73313
44436
10860
157701
33660
27385
159530
151584
85646
74154
116189
33618
130393
125746
195581
126367
30511
92579
53355
165496
160876
94121
72190
149349
139748
183964
42816
97760
176305
28602
16044
154525
44529
175499
24280
28809
189477
79550
16012
152948
117833
58205
30482
8661
33479
163137
169057
141207
144901
43804
178194
21005
57024
189936
178502
197042
20626
102722
156544
99134
88234
144181
196583
188001
169261
121383
153382
58763
50641
199671
19147
184374
138177
188507
133813
65549
8801
175363
45794
150040
119956
13662
110878
30328
162925
168265
173424
74761
94105
152434
20183
158452
180781
159670
158767
159194
156179
79753
172865
86878
109999
8930
189281
193339
72093
93664
50729
96419
149114
128165
105382
113577
113241
92549
139414
27496
182100
14662
82290
35384
84320
70414
136447
178621
25073
59680
119548
95316
86493
195796
79227
93353
93822
152784
78041
111713
56800
173252
20351
126277
40650
73297
197853
124013
1979
8333
90072
31606
134606
80860
168997
10176
33878
23082
32094
11256
41403
125332
69044
83095
126818
6698
103141
169547
139424
22903
87478
16548
17436
86394
17433
148333
60744
166680
122747
196150
192661
173949
63116
42708
103332
9544
46612
40042
131844
102496
118098
18346
134370
162899
197510
167040
106040
26796
145319
74050
101063
68537
196291
132371
114907
115023
73295
192777
192375
22534
73234
102822
181860
38522
82994
29888
32128
176776
39579
135851
20243
70749
65264
162013
103385
79037
16289
66059
91576
7048
70306
156282
107073
45391
150721
185623
137091
137927
72273
173938
173914
49645
21129
120938
6977
300
144462
47137
141909
203476
7209
13888
162746
158659
127045
41714
22791
162051
61436
96729
173262
163851
198761
78590
122320
163097
14179
4225
111952
18275
125257
203932
139099
26817
175127
193931
191527
166818
61201
130086
44979
89298
93068
174978
157700
2906
90625
66075
38086
60290
169968
111610
39614
22060
62186
127955
157665
151665
10729
13079
80527
138640
195330
180747
97854
60980
129423
63854
186706
122058
25028
52308
26145
61258
54634
118777
131672
57149
46216
19127
121555
139485
74036
181931
95326
125621
94668
27201
52502
9567
58315
113436
132641
171459
201627
26927
73272
11030
131337
50528
155018
197009
148938
190702
128236
176804
150271
195212
89228
168999
104638
27610
42532
120112
78402
27982
56314
165567
26234
94895
10365
164222
130665
33948
112598
85074
135208
126703
80689
61294
174657
165437
203427
192021
164552
70477
51526
79041
6850
109397
89656
82860
183873
197835
82903
176665
90045
34046
170717
168205
170766
141976
73045
167853
38885
120432
159946
190465
191739
63000
75713
196329
44408
59181
100415
189017
85100
50588
113461
57722
61960
126003
173146
141672
59199
6947
94539
185351
18526
35847
169035
58362
58579
91416
16640
95410
123795
3752
66060
61110
131995
134241
37268
48006
11453
193060
175364
186575
67624
114432
144921
122081
78208
47029
43436
156470
104779
69450
151937
4973
157870
140051
81893
19222
166158
170406
43068
162027
91251
53440
192535
2808
11991
152505
127180
146137
108537
199621
180438
91702
203590
111216
72585
122283
134860
55955
202312
101429
40189
178193
82528
186056
76916
103503
47703
165176
41206
151654
74807
5139
19722
9810
64511
22340
160279
167604
40672
122294
43631
200861
65684
29592
3640
189150
155851
169254
55216
59108
3457
126864
105118
53454
136211
138454
45595
160168
7104
71673
129376
24750
150468
9166
182024
14768
139300
107361
174465
109088
174647
173482
73059
145166
105946
87800
42010
160790
171888
25870
136128
189809
84305
201119
892
38359
58433
200220
144255
46656
181404
140762
183954
177697
54015
37265
183529
174908
58891
185180
2178
42711
17632
148950
80329
87269
40966
167879
90119
150099
44560
103600
85214
125999
141767
18174
132693
105441
73743
186965
29860
41250
4563
104122
149582
145914
192536
153774
201595
79187
147102
120563
191983
88200
170961
41246
133484
15942
132781
108981
56221
163807
48046
183357
99353
160544
11483
161269
171194
46074
31488
10075
9530
100402
157589
36450
21764
176842
129761
196758
146372
29150
11301
192189
49063
134137
80184
74112
77476
22411
63686
112063
110397
31373
126486
6529
102394
100050
175961
172769
81259
41012
66969
32186
195164
9003
89532
61812
10397
182515
89474
31805
174615
100015
166163
56356
202927
100178
60971
32700
155632
117349
142393
17094
26857
164935
118366
87882
124085
113556
10671
51788
181650
185021
187389
164246
60685
152987
164707
35636
143793
152089
194051
157517
84958
189613
132391
95754
38136
127108
45079
172424
155228
119048
154095
190680
59793
187174
122533
153745
122824
104321
84983
32401
151034
161132
97116
154657
72999
93755
110221
39235
165579
27487
191532
187535
159239
29034
17021
106566
141330
127124
143460
113544
114136
185732
30758
45896
84514
143646
32001
96912
74052
22323
42539
331
141193
109600
73103
36693
104956
34993
49606
188154
106781
147999
191088
52085
188117
160392
5543
91753
87909
101969
27216
172799
106932
160286
65404
187379
114980
122263
199891
203196
122855
113638
79446
78328
103425
173224
73343
62221
199463
31895
163718
203799
122709
56129
55867
109230
146317
118743
34909
88816
57567
167426
135936
52789
169127
125264
173597
122842
87297
33917
20232
101853
101887
180835
22206
49423
115608
16028
117844
65763
97495
64017
198905
101369
40999
72773
127485
201229
154999
193755
53728
15183
143106
144005
56333
132065
122196
199157
26385
87330
141812
116653
88250
155100
24697
6502
176279
134035
68908
6847
186879
125861
37535
162915
17744
179230
52376
17606
187709
84979
51134
147434
160364
25507
156957
71562
186417
44846
126140
134478
40547
179391
80192
26700
5245
62166
81625
177521
160230
196368
98522
45197
67280
135749
76019
53225
200885
133000
153117
164014
75990
177051
31445
61504
200287
86758
77014
24725
112812
144277
130009
22295
76093
157036
188686
157862
192799
161328
16906
63456
174613
116536
138936
173493
140216
180426
199002
139304
16412
161966
7049
80268
110187
189355
27124
117837
65025
13780
178038
142791
69549
36086
4699
55351
176290
181433
83355
104136
43057
66503
83885
49365
15468
2284
153777
39138
152366
121603
150979
146196
133152
3333
130520
175527
152777
12881
134823
15571
186388
158480
85580
46084
100839
49261
178811
136414
191593
188046
51657
54009
161218
114535
137964
103750
106268
23680
100280
76672
11710
65751
124550
167142
6073
118864
136804
175939
91530
105066
99089
7374
46542
114875
43594
12086
135785
136705
76229
1433
40529
144903
4128
134168
161558
180532
32357
57642
15317
123792
4011
155488
59363
69384
93760
18529
78666
130699
985
127322
142276
1393
153448
176123
14029
62443
68538
101509
11689
184848
83299
126876
124298
140272
69841
157948
991
174196
109964
162092
82886
121025
146012
52762
190135
31577
19918
140296
46677
13406
85658
38686
140791
57832
144420
196450
158192
115393
26475
194460
88419
168645
57497
2744
35642
19250
108367
100625
156729
54064
22194
86458
16570
63098
157415
185537
160250
71533
122437
113973
127682
53711
36187
122766
167473
121327
63378
61815
18698
117364
39876
35678
148005
71135
117363
150377
63706
151768
120970
189614
49463
23328
91740
44022
14341
68555
176897
39763
17064
20929
18144
167402
47965
161016
192003
66428
170662
9025
95595
38904
105135
154388
138419
198154
28822
61924
176138
147769
46579
47065
73949
1070
122554
116049
21832
147818
52117
16487
96062
70607
108743
25411
72921
194428
135117
107760
129073
58308
82575
82407
54385
123592
134885
156167
11655
164244
53547
197874
93809
104305
175415
10690
67362
203376
98145
183407
58069
53222
6095
152352
167416
11954
5713
134374
82383
82493
7597
115554
160688
175600
175481
31560
46938
126074
80115
130584
111789
168168
38237
139497
112678
134036
104907
107464
128801
136575
80308
43887
134446
150051
148251
20875
30750
198997
63649
191853
15045
25235
137469
62612
2968
173329
53727
101278
117230
172913
104202
202606
148405
49309
38022
171322
158160
29091
9591
128309
55315
199816
152402
161674
70172
181911
61886
57903
64473
196171
190480
151544
37527
177300
93685
197348
132152
98719
778
118664
98442
46046
83550
157690
177004
14194
101713
180849
127905
52301
39136
196406
77047
97422
58500
52902
29389
148639
51802
131950
147186
53779
150320
65224
111830
19928
147037
421
198830
105482
15672
189890
59169
195325
90919
98457
29041
134328
181144
71415
41399
192159
147270
100802
106615
72360
134279
141800
58567
44764
867
116709
148697
50456
72579
116520
20413
2281
114901
190621
40181
127522
111452
26818
202338
162124
144439
146399
128737
5343
55448
20768
157875
111168
2120
140861
117532
70191
189971
47105
723
53364
117800
201217
30661
187081
76162
174982
26624
65854
192024
185292
118997
180462
178192
185053
106061
83396
134201
11886
115783
156968
144302
124119
153191
336
141371
139635
155992
10897
118685
34977
48131
151180
87227
144974
71856
85261
196958
59439
99148
170557
202724
56679
151325
92944
70940
201644
179820
10071
176354
164016
75423
192846
174247
126119
162865
91360
135332
8690
159406
123603
192744
199305
40384
26139
182803
94497
29063
48056
122814
175318
96943
149123
79332
59502
32722
53773
68837
109062
135294
14486
87496
133064
193206
123686
195986
117342
115594
191526
94543
198883
71624
53945
66291
186934
6259
202287
70576
159294
57055
115093
85750
98550
102545
138580
128374
33211
71599
63894
202230
2447
94369
154306
27597
159414
81500
64980
189969
196239
175821
68026
101387
160235
17108
77619
9678
104425
122607
68683
147793
168739
72486
113793
125187
191719
29162
61157
61949
117493
64544
19330
113068
191788
50446
123887
13137
17858
31578
98798
91833
44891
92982
31355
114085
16773
4135
199473
3
60491
156280
199333
171263
41742
94219
45447
75326
172746
87888
9776
45879
57023
111150
24955
193687
199040
97567
156266
115003
27571
151633
20493
82529
167132
129679
131925
183794
134731
179762
191255
160751
171716
68237
58757
126580
118880
63423
52033
93375
74456
19875
16964
84434
119194
40775
151220
135827
70207
82309
158111
168616
52317
97807
119136
52711
23665
1231
53719
183549
16686
182531
124475
29976
120857
185038
106055
46705
109522
129296
64631
120451
78013
64023
23575
67161
121942
149679
95228
34190
134439
42356
78524
40822
14916
151048
140433
91204
171352
80396
190175
167803
53295
1221
51592
54910
39499
135611
108974
99865
174208
82478
7383
43238
84493
6572
75819
33816
84037
101318
163396
188577
195111
191104
121315
185523
84734
106020
54316
20928
56160
121727
117429
199462
202450
197680
68218
67403
78475
43407
128618
136463
176877
192491
156202
97157
89875
112938
132582
202320
126402
93223
52083
70548
128025
101003
147448
30932
186654
64434
146153
164989
128586
198329
22239
132918
31055
22561
148740
94628
64741
176649
202066
159941
94224
110958
6270
126998
179931
148445
137571
124928
162830
85407
177291
21181
183842
19157
194041
101405
69027
88426
108023
160528
172727
54707
189760
62074
169268
200882
120047
155041
58426
83097
8461
180232
26760
196430
49758
83797
80997
148348
137899
47147
103305
65357
92950
196581
154049
69168
125362
82024
127844
159024
63462
35189
104532
16243
110834
174554
7381
195946
63989
45664
55081
8479
14783
15871
162424
73806
29175
71649
36133
14868
154699
41026
9448
18752
40707
127818
113155
112661
169055
184372
137546
59630
75300
61903
142397
12329
163661
155760
118551
108938
200043
11629
75557
180023
160277
45280
169921
22793
6477
38150
126951
89543
185783
81784
23379
186106
35416
113092
114321
189126
111468
57366
82310
126661
156532
43029
6487
49234
35871
93119
98937
153833
37434
177600
164803
1316
62187
166478
108704
143339
102958
95922
73194
129856
91308
39870
107518
148817
139033
26380
131429
11108
64242
87179
166664
203717
144128
31462
94937
29577
169826
63308
10477
16004
78791
128458
202777
35185
127077
34235
161582
75290
1122
14780
136258
35019
86568
148469
164130
144126
158181
202456
185907
132224
14108
84620
188738
94405
119909
61281
91729
28011
171156
19468
143519
142648
26107
182334
8793
41396
73742
137325
151217
114986
92430
169882
90740
140349
160380
118304
96538
33252
74962
146049
76244
133037
117874
61910
179132
185046
138296
25636
10580
117834
75330
22427
64435
82740
57527
28128
54601
128537
64229
88929
139951
109887
109849
197087
37619
179376
22670
176222
43410
13331
73116
126104
48474
37831
112378
173862
1972
82450
158866
100484
181037
97143
175049
66614
104619
56807
117059
152925
12343
48227
18484
142097
28760
73551
159186
192515
104991
138723
203792
194766
79855
26253
142220
112936
140330
31854
123846
46048
187466
140308
61150
9283
194117
169023
183900
78471
108843
98679
106076
90861
38031
29408
41626
195584
167269
32466
47903
70877
70027
77493
96313
198171
202647
50290
109822
146402
138636
16904
72497
33664
130690
7297
134391
138856
75420
96397
79884
43590
11658
72478
38111
160121
189649
65249
22524
108790
195451
9597
47614
10314
190434
75059
149048
89837
18913
86227
170829
124750
131336
188505
7686
142883
5537
30496
193977
151507
13492
141858
146099
203426
92534
64942
184039
49954
147357
148531
14176
112234
34327
89921
142789
168101
75263
96000
117892
51286
41779
119152
101403
85734
77176
124437
69441
47337
10037
186314
96631
25395
92182
93642
30530
109094
159718
198430
131185
82082
197092
174727
91544
126236
198108
162813
72537
54239
46862
96775
102736
5339
128557
98281
180254
177130
108674
22584
144073
3047
139454
171876
118747
118346
189368
178158
9869
94072
89943
95550
102809
47891
44397
112477
51164
119453
137269
179316
85808
130628
183087
83244
24771
164977
173291
175841
195961
164253
132431
134713
134675
35257
181823
47882
112952
63629
36360
95810
109929
94021
26548
95947
57342
180972
187984
185952
196796
113698
81467
16221
185071
71260
49841
95940
168460
42332
21620
124733
129812
128915
123252
148887
123669
8384
152236
103330
194359
169548
63516
57265
156555
139684
164403
123574
101696
50567
74913
39266
183921
126886
181012
193817
158234
179337
74289
141283
63740
5196
191175
86141
150469
135586
172479
35555
19444
65352
148708
24181
132362
3308
187974
43883
116473
25631
29557
128140
56071
73538
127920
22163
26633
121490
152570
198778
65500
194514
47838
85729
126123
136195
124019
12465
134336
187555
39654
63730
38104
157581
52958
81263
145112
178536
133546
139041
198121
62680
74454
57198
178217
20171
34803
32575
27835
175185
168089
198735
195154
139698
81440
119282
202388
50960
54661
52991
323
43455
35612
154770
144864
192614
86812
145858
137204
66450
135529
22966
159737
191672
66577
145094
35843
85026
73403
38356
91843
198203
106668
87443
102156
19913
109216
162801
20350
109097
82527
116571
175847
189223
8490
72121
137183
154269
18604
135495
102267
135160
124638
129022
52834
59614
168879
22577
63366
181652
5797
93761
138396
192190
135686
108819
103827
131124
159364
73865
192592
118501
123537
128223
60742
161893
61890
33103
29446
15418
27942
74200
102595
714
26693
59400
19396
40907
177125
122656
106513
189616
17758
154270
66924
178828
25972
196472
19282
43680
135544
187840
127258
176460
72388
46162
147028
146635
182481
36668
182698
59944
155605
74554
181399
10711
36637
67727
191656
72355
92431
150626
156670
139605
82671
126510
104658
86824
140687
30799
47232
96272
203971
29453
15829
151416
156588
97803
67808
66375
91569
181567
148007
187492
193387
61956
94741
159627
152242
106867
118426
183952
185704
46907
35354
139200
117005
86781
93810
132158
14201
112552
151234
192521
102523
139013
41476
62055
84764
121644
30692
70224
30542
94991
129221
150838
160241
109188
203265
89625
124351
31042
127962
11046
49321
153727
70646
3350
110384
140232
262
192203
103464
66083
148807
61600
69943
5980
198941
166100
23946
87113
70039
122805
142288
60285
185011
49634
11708
2687
37749
116632
136990
50398
123429
80955
88401
98677
29463
169552
156072
14640
81953
192137
106808
35002
194187
76161
35664
4633
141864
142468
85302
39232
88168
120719
18387
202149
117598
107302
173935
105231
73818
71697
158453
85657
51904
112009
173627
100425
88410
157713
169170
160612
170999
1557
196190
156601
50425
24945
48342
190694
90895
192177
51981
134490
173058
170912
4923
29290
100673
28637
73421
45854
39944
203794
131726
185635
145667
148117
167255
23670
101868
5150
120133
88743
144982
4504
191433
103747
16374
77656
3896
98197
183012
159332
195346
24663
73890
144673
26080
200477
117676
158950
149627
68519
172875
158272
112589
161122
192221
36410
6458
168055
170983
49116
152096
129218
86189
96320
87556
143320
202447
159843
160549
179214
157098
27509
64497
181571
121896
113191
163032
189551
116833
175166
86273
181222
159425
91158
75513
71498
76684
200251
6042
170454
69288
107977
48898
152556
79240
77961
74523
78340
63986
90230
96814
153495
189941
140500
194341
114362
56089
12703
145343
145336
90295
64835
201514
165819
49904
1096
145759
144205
98351
10502
114624
41173
784
166068
64419
64786
193946
150950
55381
151907
159686
60271
164770
42243
91041
160153
68879
106179
88765
195521
163376
103028
93013
95290
182153
6519
92535
9446
34041
176593
85556
109292
37134
169640
115815
78690
19586
177417
95953
191545
5885
179201
12850
187679
112844
110185
178205
182322
181996
70184
199741
114635
78768
196664
193146
180727
70691
184688
21646
163735
31827
176944
103739
195520
185645
142982
78058
27740
90777
15972
25321
35478
93612
134673
9100
140393
201665
35389
27769
130807
150434
145801
137124
43443
197913
117210
164240
117469
117554
329
53450
74074
62752
10311
58819
94458
177718
107561
63409
34976
52494
127360
159449
149290
78902
49884
198566
91799
112534
162621
192758
173195
79412
25170
118638
84650
172572
198059
156033
41261
182107
90258
8859
133023
80579
48895
107789
62582
199295
76502
31073
143396
112259
62968
63320
10423
63259
74778
24055
19093
165429
131615
202065
61358
103003
166024
63156
164618
116105
148037
55680
91647
72728
35001
50285
148468
132985
102649
191360
9705
114257
140126
173735
158602
190011
50951
77558
86129
9198
110881
92319
132379
114545
198332
41852
68384
51570
65667
196609
171482
108597
48384
142697
192006
71585
23662
180589
118629
71285
4944
115103
99477
132646
137668
60438
94087
4947
200518
172802
25632
89865
201951
148942
119405
64798
70225
198721
196571
175890
44065
41776
87030
11051
121965
135378
34087
97267
48311
193202
26757
59210
120666
37277
41119
52124
160682
178634
97181
131000
111600
25873
190318
30613
190674
34693
189657
140254
65076
74099
123377
166717
170379
61537
33266
38510
51180
110411
183320
101470
108391
103409
169887
56623
164741
77198
184905
75371
96370
38253
131278
164237
93123
39552
202527
143835
136891
71899
99200
120414
160737
124689
86515
31324
57298
23504
177249
80137
90949
29055
82812
39189
91867
84494
122225
178796
120197
191509
31990
43115
30228
198179
71256
9936
48856
46139
130846
170451
91723
107486
74316
23276
156407
49711
76939
105510
21515
83058
44092
68227
96449
24711
17435
178322
89096
68589
174557
6114
29625
19060
69254
46430
86858
169259
22655
101697
9284
186399
84403
95338
13232
117253
160561
150697
173592
68054
89628
189104
179472
34712
113682
156839
25759
190894
141781
45195
189061
83627
159674
106569
147464
32581
203292
128525
108933
72622
11499
84956
62769
121845
116724
203548
48871
42173
124405
12587
132675
175005
129281
90986
162207
4424
102071
105715
161876
150917
18043
111034
8083
145959
48187
160634
145000
157806
57631
61407
168020
192166
197859
42269
103583
68991
132709
115686
145334
195468
132013
5406
157243
86691
87476
102075
119865
32781
109743
173089
111801
115456
102111
54841
22269
150524
168009
163361
152707
127909
136284
151303
12518
27058
197183
104917
135981
64066
143169
98514
61062
65154
174357
35161
6999
62065
70830
193875
76089
102888
75785
164689
34289
36926
193457
2623
183142
135695
77814
172485
96826
97379
59569
45876
4869
122848
104414
111517
156474
118628
151854
149641
175180
125186
56316
78095
44898
194319
146025
181994
187990
50586
90676
57109
67302
152164
137349
39123
37595
9176
33812
3158
113750
47911
127964
186926
155614
125239
152862
11556
168712
4545
30501
26664
84370
61690
64275
127396
159474
12919
41882
47491
39354
103766
133280
95261
25550
146609
34536
39313
19814
94321
164469
65364
20670
45947
56776
70674
48173
105051
68245
154249
101101
117362
84719
143381
50167
108524
47749
177446
159355
86254
143456
112331
132353
11544
185411
202247
8703
27117
37417
51193
39690
10998
153852
89613
10909
187744
194351
110948
172067
10241
1146
105334
184410
103376
45025
182928
63671
116893
123610
167092
87264
38353
90925
11864
100558
180009
118801
200099
66671
67742
170908
191860
173670
105851
52677
89790
201492
159073
19512
170911
25085
42456
27955
192388
150590
174032
202088
137576
37550
200121
17286
69007
170713
117997
5319
124480
165194
117395
72514
84940
106623
138264
103592
135020
90112
25455
40184
84840
166541
134099
76453
197720
117797
153053
141034
114807
183751
149791
21154
77696
75917
196881
8262
39849
150636
74481
162555
57242
76220
195075
121050
114075
133911
18238
141361
196339
22784
17796
9354
74077
10503
117888
26582
120469
144913
80876
105363
122014
69658
141662
102946
34520
87576
200680
28972
49417
113418
126912
109880
121958
186811
42139
75571
31514
20648
88691
7379
77081
137822
95693
39884
69265
44960
88389
5799
182924
4884
129524
184979
149489
110101
130500
89049
44269
53805
50145
198005
108986
112632
51117
118882
105530
149537
119772
197149
65173
25662
123816
196294
75079
102794
147143
81744
143965
166827
73145
126182
92574
196617
168334
140968
192314
173364
96996
171848
18230
7872
159633
138607
75200
107225
143505
82012
11278
115811
158077
60961
21490
29929
147795
128193
8863
199691
130819
17884
157348
147403
40670
95774
40058
148413
131056
172692
148931
127721
59685
50046
29754
7059
77959
133175
85401
140910
195
113036
108593
175368
101189
162268
178967
125158
13701
7625
145403
71492
108991
55479
16524
71401
113912
200209
201292
27784
101940
106521
28298
132323
22064
156418
145600
185229
118606
68773
90102
85868
116500
99956
189791
94163
146733
76946
81797
158909
157056
135422
94210
164607
4805
22591
33770
203962
138555
140301
50218
111640
88319
37729
14245
145045
183835
138807
139747
2015
145776
159273
152310
34522
74160
25362
129912
175356
22705
9568
175998
67881
3539
4197
116047
73843
108105
26895
84624
19132
95165
143640
38257
68775
104580
106140
67175
82483
46249
67717
52981
6690
13387
112976
194170
121527
146929
198924
192181
172788
203216
28565
118583
23372
186474
95143
195555
39831
121749
16448
78552
154537
49391
151518
129138
74004
81705
136934
193270
31622
176121
75761
114594
17055
119728
184398
49275
90532
138021
106738
171607
91648
161370
34449
131075
2407
172969
56561
62164
103578
20500
81815
86452
185927
5321
83766
95891
507
188158
155574
114622
201210
76285
157817
181955
16274
20322
165630
116961
29272
25247
107892
144008
191609
28244
80637
20796
106872
26009
135534
26015
201387
34902
123094
119577
70965
152173
142126
136622
168139
191463
61296
175816
185735
181642
165364
121624
202052
144187
106146
172919
104437
34808
60341
158442
12185
51190
153630
17242
85696
17449
131703
187524
102909
141816
33518
83938
125568
190771
47092
90796
75285
133570
33839
66051
81923
25795
24386
58096
53862
117633
103422
42804
45816
139255
142770
136291
180312
106104
126745
25510
99669
88660
137127
47162
76321
181291
149247
156621
173119
33415
47490
192116
140495
146534
176092
49728
55283
203723
172202
55625
14927
145096
168988
173407
189209
44819
58984
175783
47288
24222
32026
39058
145971
183322
42311
172925
133835
161996
127562
199978
29399
84324
91543
84602
114576
50856
86018
192008
60025
70463
70421
41054
67529
21263
148079
121905
201060
59938
155604
62249
14339
185488
154887
139524
188979
56348
190970
92621
33776
130410
48714
33719
115316
54906
188565
90914
142166
112760
84207
171963
38428
89013
45050
114646
67035
24018
127511
46525
49155
13494
137618
38788
144352
91356
192173
86881
68110
103158
155360
81273
140922
92855
83905
173834
33794
100127
86463
54909
87058
181295
79572
121590
187721
11374
85740
77470
66310
20667
142746
78270
147792
133342
2861
159824
194377
175280
83266
106812
51143
30617
90853
176047
119708
175932
195769
189848
57852
115936
150545
137919
24061
76705
22820
9321
148242
142997
79146
56927
12747
165701
38526
66994
132034
27197
71423
139990
115333
137050
11474
107023
79025
84253
151857
105596
133248
151702
188596
100565
202825
195594
89575
42170
33597
149434
192528
50843
8550
35208
176663
96104
3453
45631
136958
69665
149366
184741
191855
53476
188403
170698
195790
152327
165492
157879
127782
104143
15489
179708
30381
113570
15957
16761
94970
74469
91498
134456
159103
132998
46333
19419
11594
197525
55543
189467
167649
108086
201114
62140
95593
68422
177915
66675
118675
112254
190519
160842
75369
59590
124249
40332
128130
179650
48847
83499
83471
25262
107572
169587
126969
140201
162557
144422
15371
69785
131810
173271
30709
191181
150479
98257
100023
128065
141311
60750
111645
175996
12039
51461
62533
118900
159109
157943
37269
72401
103471
45307
144070
90240
133400
85080
24631
166089
140908
148760
10366
144672
11938
187641
83410
91616
133899
51815
100903
149010
177584
9648
186082
7094
164860
41340
116565
92125
180848
15268
164089
149049
194595
201785
109086
7988
45067
181105
38878
197307
196428
17741
159418
178371
960
33982
49670
172499
48720
14642
147959
169835
94502
4343
44236
80788
131033
138644
126408
103800
34609
103949
119295
121106
58318
41013
123766
87715
89373
156405
155537
53823
157790
118762
76239
1609
150952
68254
9209
14389
186973
183464
155313
121541
96877
174817
182490
199461
129322
26077
84855
136012
59011
27430
53001
45501
75167
45861
141585
193096
48456
87518
152779
108820
180189
164728
85937
199896
178440
127761
25897
137492
132274
184130
126795
2014
185248
116285
75549
149864
67723
41163
28086
186912
1731
26481
97414
41809
185208
100296
110366
173189
154289
133081
30944
8388
231
64859
203783
65849
185481
81866
152225
175200
139559
15287
105445
65072
72813
119665
191314
24906
55325
95083
183009
36301
110756
111243
81342
196812
175801
75824
70979
196370
105602
135143
63267
19869
43022
156229
113038
9272
5808
180837
100253
6876
64559
155577
120706
59350
117674
171891
20547
172286
195510
67553
32890
134127
89900
166609
78838
173294
128560
74395
27483
160024
182383
65979
159440
76365
5724
4438
153176
31284
24667
11123
116017
79801
172039
197790
136043
177447
52034
155754
21793
187371
21431
58778
17680
50558
45804
69185
197090
90057
169439
95226
162300
33374
89863
102680
44320
60197
118841
2075
184350
165592
187887
95969
34264
83366
141713
505
50694
61639
137407
166563
90658
22676
48201
148023
65959
203952
47660
92378
83601
105802
114698
165875
38960
155569
81915
184010
35738
171903
159184
148266
166643
146751
4926
162432
118601
92081
186810
50800
145450
82524
157151
77581
166002
101835
154375
114672
95159
113006
188381
128798
130291
130272
169039
99584
44100
117126
96731
195366
119138
154985
81912
69851
21076
115747
48075
104949
51781
56332
69483
196391
40940
153813
139914
118616
161397
37685
26958
159786
414
83215
190842
31123
138022
114939
136639
118258
87184
114909
9258
26831
37481
6694
125845
201980
74747
132488
36305
178221
82643
50057
57208
146189
48023
34887
58330
64627
1135
37720
48657
157709
152881
98697
129040
119069
58480
61824
86605
73419
200319
77219
31397
39115
66297
15590
34984
159892
201945
100263
136361
135188
91310
139599
107507
129011
24817
158304
44484
151312
40674
135155
152780
71565
198984
55105
176844
86693
43947
148742
97384
70812
117077
143717
137743
187340
121513
82363
110803
203933
200979
151512
188426
145684
17771
25415
180379
86792
146302
19214
151572
131826
86728
30165
12125
3552
203346
9858
194360
113774
103128
8498
123821
143089
132618
53545
105882
66432
155087
116064
99580
29756
200231
107729
89662
111608
158147
44097
6485
190237
61236
114686
128353
125731
49153
164029
171754
98206
153132
115851
55161
102712
99923
148044
76118
200374
150438
39747
77897
62775
114470
31703
23264
156404
96798
169759
84700
140973
29067
78337
25381
105192
105238
34078
143450
4036
127061
45242
98591
119400
52543
203858
186401
187106
1849
71449
101929
188458
52790
2432
104216
101056
28263
47143
84496
60571
194020
93066
103757
53272
135470
168297
198383
48138
153682
173161
136241
14015
68606
20948
71842
162204
81711
81385
144523
161789
100139
72977
30855
180493
26537
37992
111358
63332
188678
117459
160746
64373
107773
130539
60213
53939
35533
116929
53794
5773
80818
166475
75782
56632
202907
139793
114313
42578
41816
165896
177556
41664
140029
176799
202190
108163
148608
104523
27131
57963
191378
183888
23547
174899
53943
100783
181717
52212
29886
60866
109263
129140
180031
165171
129021
153273
174482
164987
70031
123527
141363
61100
155421
190707
90647
39146
19161
16124
15921
201049
169058
13392
153192
156716
201599
86101
114870
122801
183061
88079
64451
187754
19355
188715
40965
142634
38273
188419
111071
182573
138077
107743
9702
185589
96579
73968
177153
169866
132340
194527
174836
124045
111799
50870
186942
67133
203896
69715
88387
80259
81338
56394
172990
99663
159730
134589
114247
148287
117873
36761
117338
38860
166305
200715
61719
157844
31411
7987
39941
58629
62433
182745
140827
180759
195039
190890
47815
91305
187629
76544
121714
72890
18838
91652
101072
74854
122830
198782
19640
123975
90335
44220
5964
153367
101501
90870
137427
29945
163209
87854
198518
46459
181398
92242
142734
83141
194820
201519
164245
67568
65535
74530
92241
134697
35985
134068
167734
126775
27862
130493
37093
188607
113942
145226
72361
154214
168721
77975
9188
76877
41614
199887
185140
193941
129122
111319
183461
165150
128510
99618
121831
132173
68424
41998
120401
168373
34967
85348
193391
63196
188014
75492
92804
41684
113521
39509
14738
149626
37320
45323
5588
185874
111659
187268
87709
191465
43879
29834
142735
41248
137609
181293
78716
195186
66943
17062
86836
96888
64997
160320
135528
2607
169527
116007
51966
17365
118810
16594
117323
30594
131827
159768
92423
70595
21886
158529
102435
61635
199907
22365
154427
32952
11998
11110
148982
33046
70019
121949
14958
27874
71868
62357
62005
99557
27865
30085
198229
142581
189056
101881
192951
10099
129445
183452
19845
86022
44886
141651
118679
66959
195821
21962
189581
105795
105202
22698
93323
69578
98319
165413
58149
3051
135178
98732
96754
183451
72724
63049
36691
151204
62959
109284
3431
32750
96957
197527
81083
35457
101074
73458
70336
161293
150925
1378
22872
110505
73584
199204
29713
59771
70150
41376
164434
203273
182925
145507
203457
137811
62479
192056
15237
124820
139863
27313
95598
97333
1641
38330
74693
55716
170675
24638
48395
126553
35214
20886
170897
62873
146112
107908
149326
106959
6940
138496
142761
39171
118217
156786
160788
169815
185844
119989
120909
78308
80907
44056
68483
18841
95026
180256
23782
27398
36631
48903
131808
185450
200687
15105
115604
71796
175957
31737
149746
200309
104661
153262
139423
73772
84640
39814
187692
15087
28711
26038
64498
32307
64563
90727
58056
75375
120358
202256
8707
182741
51795
36635
105726
485
106432
177033
22775
168047
193458
15303
52807
71352
32016
83305
17170
177430
138429
63012
72228
168786
59150
170403
7828
12614
174813
138940
154786
106450
100283
147943
29419
113104
51050
165539
101425
1591
191726
186720
63028
51602
184746
56986
64553
175256
62780
64694
65342
31314
98694
51767
119430
15654
128823
199719
202720
144742
143262
40733
62981
50078
119087
15639
161199
51491
115616
2322
176867
82548
20067
115808
21722
10584
159908
200292
7480
117632
64364
99312
102833
124370
93130
47509
196317
155523
111045
188231
148144
170039
47465
74722
138041
202957
62270
98126
185997
195798
202746
19568
74061
10012
93600
154045
7095
143562
14008
191362
47058
145556
144658
83993
131154
39310
61053
131949
63073
11598
71288
154035
42827
41213
98190
189763
86916
98958
164329
119970
405
117745
49245
135877
102362
123169
79074
21252
117635
184582
179851
49007
200877
90704
66064
128350
99056
74848
14430
1307
112664
100952
49335
128877
8891
71284
2472
51254
5039
29803
136743
30022
108409
54335
32377
103555
2980
37728
70145
66922
53645
50193
118535
122878
78064
168678
74884
154082
136184
122001
81472
2223
61485
6472
118588
2083
50578
169189
181645
98210
177216
93827
48218
101115
94477
161098
178900
194402
7470
159951
60273
72872
13729
167447
62260
125037
7258
125035
89546
140556
68904
112037
195819
371
100756
59723
184456
169781
114038
61295
31664
61794
101145
92669
82719
58668
188305
194037
108340
8808
93321
46605
7611
33800
102994
162202
109768
90499
187350
173186
149361
20723
156800
162738
135962
183073
186130
97749
168266
115774
84839
31819
96970
92868
40180
154247
78147
176188
123878
38594
32372
70289
108496
101875
120532
129055
12520
18048
191058
13870
186168
64383
96292
103414
101070
125018
115475
28103
32880
178773
67643
8866
133471
14281
82898
182819
142092
5828
126059
47069
186722
138965
181760
115437
165191
49849
187434
1050
33544
152403
178522
39302
103343
54606
189013
22742
145114
64932
34910
42568
151104
149405
165434
164445
201628
127068
89929
195206
138751
195550
147781
147013
69117
100617
172843
127142
15282
136871
99276
128770
104596
167371
169730
202404
101558
131428
4298
106026
133439
48268
122614
80054
149964
109444
2567
38036
43560
151638
110126
13798
36822
52556
97412
11015
50763
23673
108561
142141
63898
156552
9369
179812
32500
146394
199179
98703
10659
98156
68521
99734
192712
59274
107512
76588
1154
77339
69774
121599
201729
97374
133298
195849
176280
21891
15844
88873
132723
113458
126721
73573
2837
204055
152815
68509
73105
173330
173467
22400
3380
12052
165011
107144
190755
71609
160060
118279
18872
39226
166323
48765
110453
38770
133943
157240
120123
170469
128324
83545
185100
73382
48719
76776
166471
67114
53202
102410
109202
94363
16436
187128
126311
34661
67803
107353
43679
29955
55103
181448
162658
71745
130507
173471
9117
118028
176207
29139
158472
77727
30097
58258
126872
21216
94785
56053
19599
66332
143122
65724
94930
169315
182333
70443
73864
176581
75379
26588
165336
65943
150738
97771
101268
66900
56612
182999
113623
123907
12208
19865
104965
158749
109746
8295
189617
192100
160551
23438
37746
141977
100820
85461
95890
69685
82619
69720
96842
197761
91207
114886
26625
166929
133735
74376
134246
10195
108122
10700
25875
42935
167461
120367
70666
84725
108446
89504
100352
175654
141082
11842
176988
15606
105506
34934
83635
187423
116844
554
164674
106687
11387
88563
38493
99664
150811
11678
187288
85390
31082
29153
83774
125417
47512
105255
22246
18565
76394
67799
129219
16753
55010
23836
55082
100845
145758
175084
184883
124161
177257
59132
95086
202879
102474
86331
141979
151120
203870
24080
132329
142307
170661
116410
58335
59288
60823
55363
190510
105898
202432
19873
27562
49157
47745
99952
10301
161887
165827
173650
157987
2692
154894
85091
184648
201904
10759
177728
11944
178665
30479
186110
154473
106956
175026
186039
74475
98306
102388
65471
191909
203043
33012
88859
70102
154370
162280
70177
38266
147008
48860
185251
169952
69174
123149
121840
39910
180397
7679
182521
132749
88067
201313
157664
124960
157732
66063
6470
31160
157937
78792
37103
132531
108418
64799
154508
133430
165580
154731
64276
199215
54422
81515
95645
97520
109419
162101
63755
77685
51255
88826
4477
192338
87578
84684
19476
81670
8549
82544
11748
49311
135197
89612
169499
38660
45231
99988
42739
124981
177808
70447
37952
3373
103469
71689
155559
33265
56764
93464
188722
838
164850
201361
109961
184950
52255
197447
86071
3348
167499
144818
129566
166551
202134
161677
14672
181127
129025
202264
114512
48666
27901
66493
23168
73307
113872
131405
15933
71543
8540
3891
39899
136643
66363
109201
165450
30510
157479
80170
173181
166130
3155
181351
41934
43727
176796
167051
141340
81730
167777
96490
28792
20854
3084
85805
58245
49826
21465
88658
82752
87272
129485
190869
33517
108305
43127
70015
193758
27721
116602
125318
146822
182948
111615
129416
4089
12585
177316
170462
187047
93749
112450
182274
194372
56931
145435
50941
68632
165104
131594
122419
108432
195471
107636
78809
107837
135759
22031
131397
4940
26254
143927
84505
66630
182775
138811
141839
97655
66956
38568
12982
47869
157071
199060
76753
57614
78081
155454
67671
29354
162425
54636
166634
183706
133360
85697
104045
124208
94026
82183
90998
93374
79048
154691
190190
102705
111684
76825
9192
49875
134111
48156
145065
141433
157757
67906
132255
66167
155037
152800
29056
134810
52919
170294
69162
16575
61187
194786
136160
127639
141318
126982
113168
59306
164678
59679
104377
126478
201777
4023
74047
44015
44394
191111
47784
83292
38008
44866
193174
203949
33462
113961
81697
94263
102768
67301
179237
15093
203915
531
193242
26980
159618
61153
109048
125434
157907
186103
156974
127307
66767
61876
172332
67766
167890
127250
199735
73463
98347
102657
175516
53041
20597
1572
25755
83710
10143
16907
86085
38310
170209
141565
61235
154363
142063
98929
142837
56300
181171
188285
49846
185985
100011
46434
22663
110013
114678
15841
149486
50892
16829
32005
197548
99765
104870
51850
189312
55293
157808
160321
92964
184463
202063
131665
88756
92652
180931
113767
13867
156094
48826
145592
54397
18400
12050
159826
148059
105047
198227
181465
106562
79186
60726
24727
10471
201342
53061
62717
145397
125498
108533
139689
140059
95740
193910
22247
80365
67616
171070
58121
27582
125904
198405
27011
28487
29006
105355
1970
184566
71462
194363
128470
116910
81389
47985
82727
183211
101170
60896
170440
82446
22746
181591
45603
188953
35597
28608
48224
34662
113953
140569
164334
36540
200558
126551
197657
19376
163643
146580
52177
69059
33107
43622
73032
127230
16603
4420
63268
181605
25683
22488
56185
92979
191143
146271
146407
152116
96129
38069
144324
175494
74113
92934
97295
87123
88476
90290
134283
196984
112612
105902
3952
117343
35479
114245
64118
149446
8689
36557
28377
199985
172258
12252
56105
1986
47583
152761
186335
169560
12786
135803
89156
59504
93709
103570
193753
176855
81714
104765
68545
13424
147218
77159
113429
80011
125054
28122
158575
85936
50208
78236
61082
189248
104379
156866
198546
86980
197311
50912
90085
172488
35637
117651
56534
79628
53417
23441
41507
60299
174797
136711
153169
184495
133874
109353
45763
60649
110600
89741
167144
141688
167908
103411
73812
82728
164749
74542
15275
5147
177816
5984
142337
63251
64072
83282
186924
680
87292
79278
14786
5908
77249
153525
201038
152353
97159
152425
42947
72834
50388
114964
124290
163109
175236
86109
973
159383
44344
32720
89456
105976
19741
74204
102653
148534
183817
86322
108536
192327
171342
150228
167383
36059
84663
171831
129325
166521
130516
15641
62979
187892
7350
115875
109411
14796
65039
202893
106636
88552
131505
188537
50383
87333
171381
42718
114057
166597
69149
96563
127119
167958
43341
43082
139905
23217
79566
134384
160932
52403
172203
61550
136035
10333
25384
65760
173249
120189
63469
183967
165182
184485
86333
193093
27068
18276
175894
118980
92905
122184
112188
40556
121444
179775
8556
153717
177128
57944
132377
90679
106818
155853
46869
191347
133779
63010
98378
59581
56942
81772
26271
148503
118104
169252
104522
132648
162640
94235
201931
127435
157569
20397
65032
182787
130892
174625
123950
27815
88590
172162
94783
22026
146994
192305
200645
186680
92079
141349
88466
179701
36943
79772
129862
66209
176321
141794
147846
178052
106034
25290
45800
59051
26185
157321
64521
100119
93910
191160
23818
166580
33477
146030
23505
58932
153346
43255
148225
53162
95927
136514
74297
56286
91214
69502
93871
185743
67125
87520
30142
113065
130148
77312
88266
174501
108460
198788
103710
125497
160112
183560
61961
11562
138728
149975
191138
30923
102993
203250
65440
166623
62663
94598
36894
172637
116331
125986
187575
29429
86181
145338
37442
92859
91016
104520
161212
107683
169981
119736
193557
15686
171149
114515
139152
151815
112237
17826
95420
60079
59834
16216
50354
51559
128577
43234
167084
57814
125627
115266
60503
142582
44313
170458
74385
131811
74970
30502
143213
77057
4214
27242
3701
159817
57320
160432
82293
178741
193261
26288
176453
141537
11283
47373
181863
73269
155876
76752
2669
176740
105570
135423
38933
44155
111881
90418
41070
4016
92892
141517
74715
126389
153657
69596
19739
195604
159026
120237
119922
46119
180741
145879
20941
62827
163943
42312
65413
136185
43605
67961
115130
203224
152771
24505
36859
128932
168445
42705
120811
162551
33443
109538
155121
103565
185562
26180
19939
1061
32238
196868
195997
133211
70132
81271
731
11554
96706
179810
137740
124028
90354
131795
125340
130765
189679
190393
178671
180872
92893
182756
150110
39822
196698
64748
79808
73033
42399
90716
177034
33122
6799
196837
55410
104142
194035
148521
164076
93770
38624
27448
129609
127576
28571
65472
186528
24040
16164
199737
2929
156190
17277
96511
170636
176034
30874
5672
77568
103144
154685
184507
5060
158650
78670
69709
174583
2346
182766
126894
36167
80480
70080
58267
7047
120096
17821
6960
200164
42471
65781
123123
143212
102014
100553
191469
12857
179758
178347
7159
138476
29125
1034
122339
2743
41735
90577
192831
48505
109585
81045
66191
98311
156253
179351
27170
117724
82550
132943
198828
141861
164802
4033
99468
148725
96056
96663
154444
172194
149341
121880
94485
115597
42566
20390
78703
82660
162550
143074
123569
85774
198970
180649
80302
54407
47921
153432
138759
188268
80980
123996
149532
79534
120228
198730
5143
175010
178600
33447
23917
74037
28202
37871
191728
202540
52026
184425
6094
172013
176066
165974
94233
180010
74601
147073
167922
49419
105
144821
48019
166227
201642
12988
2011
113816
159864
73785
164186
162635
95054
179189
129796
258
128620
172361
156533
65585
192074
78526
77045
97799
172775
51726
93221
50987
187198
102646
142225
162344
9490
189395
75360
166956
128518
68159
30445
160234
100680
132248
144629
107980
57390
34870
147583
146557
90221
145783
73256
138418
133008
119016
160699
20187
20750
66125
189210
40768
200742
9421
34505
57926
131970
123902
134868
156740
118695
169372
137190
109081
4433
147889
172936
123097
105450
19306
50647
197987
35118
191875
197091
134637
178593
126271
152860
59875
